---
kind: property
id: P:Autodesk.Revit.DB.DividedPath.IsClosedLoop
source: html/a0ded64e-422a-b3a5-fd4a-ae5c1f82040d.htm
---
# Autodesk.Revit.DB.DividedPath.IsClosedLoop Property

Whether or not the path forms a closed loop.

## Syntax (C#)
```csharp
public bool IsClosedLoop { get; }
```

## Remarks
True if the path form a closed loop.
 False otherwise.